// ignore_for_file: constant_identifier_names

class MaaData {
  static const String title_activity_main = 'মা অ্যাপে স্বাগতম';
  static const String next = 'পরবর্তী';
  static const String previous = 'পূর্ববর্তী';
  static const String save = 'সংরক্ষণ';
  static const String welcome = 'স্বাগতম';
  static const String dateChange = 'তারিখ বদলাতে এখানে চাপুন';
  static const String slide_2_title = 'শেষ মাসিক এর প্রথম দিন';
  static const String slide_3_title = 'প্রসবের সম্ভাব্য তারিখ';
  static const String glance = 'এক নজরে';
  static const String week = 'সপ্তাহ';
  static const String day = 'দিন';
  static const String month = 'মাস';
  static const String running = 'এখন চলছেঃ ';
  static const String remaining = 'বাকি রয়েছেঃ ';
  static const String survival_posibilty = ' ৫০% বাঁচার সম্ভাবনা';
  static const String first_timestar = 'প্রথম ত্রৈমাসিক';
  static const String second_timestar = 'দ্বিতীয় ত্রৈমাসিক';
  static const String third_timestar = 'তৃতীয় ত্রৈমাসিক';
  static const String weekly_change = 'সাপ্তাহিক পরিবর্তন';
  static const String text1 = 'বিস্তারিত জানতে এখানে চাপুন';
  static const String text2 = 'তৃতীয় সপ্তাহ হতে এখানে তথ্য দেখতে পাবেন';
  static const List<String> categoryList = [
    "Dentist",
    "Diabetes Specialist",
    "Gynecologist",
    "Radiologist",
    "Cardiologist",
    "Nutritionist"
  ];
  static const List<String> weekList = [
    'Sunday',
    'Monday',
    'Tuesday',
    'Wednessday',
    'Thursday'
  ]; static const List<String> xValueList = [
    'Dent',
    'Gyne',
    'Radi',
    'Cardi',
    'Nutro'
  ]; static const List<String> yValueList = [
    '12',
    '15',
    '11',
    '8',
    '14'
  ];static const List<String> xValueList2 = [
    'Dent',
    'Gyne',
    'Radi',
    'Cardi',
    'Nutro'
  ]; static const List<String> yValueList2 = [
    '16',
    '11',
    '14',
    '6',
    '18'
  ];
  static const List<double> sWidthlist = [37.6, 10.2, 6.5];
  static const List<double> s2Widthlist = [
    2.2,
    2.2,
    2.2,
    2.2,
    2.2,
    2.2,
    2.2,
    2.2,
    2.2,
    28.05
  ];
  static const List<String> sLetterlist = ['A', 'B', 'C'];
  static const List<String> headinglist = [
    'W',
    'T',
    'P',
    'M',
    'S',
  ];
  static const List<String> valuelist1 = [
    'সপ্তাহ',
    'ত্রৈমাসিক',
    'বর্তমান অগ্রগতি',
    'মাস',
    'বাঁচার সম্ভাবনা'
  ];
  static const List<String> valuelist2 = ['অপরিণত', 'স্থিতিকাল', 'অতিপরিণত'];
  static const List<String> bangNum = [
    '০',
    '১',
    '২',
    '৩',
    '৪',
    '৫',
    '৬',
    '৭',
    '৮',
    '৯',
  ];
  static const List<String> bangDateSuffix = ['ম', 'য়', 'র্থ', 'ষ্ঠ', 'শ'];

  static final List<String> shortDescriptionData = [
    "তৃতীয় সপ্তাহ হতে এখানে তথ্য দেখতে পাবেন",
    "তৃতীয় সপ্তাহ হতে এখানে তথ্য দেখতে পাবেন",
    "গর্ভনালীতে প্রায় ১০০ টি কোষের গোলাকার বড়সড় লবনের দানার সমান শিশুপিন্ড তৈরি হয়েছে।",
    "গর্ভনালী থেকে শিশুপিন্ডটি জরায়ুতে প্রবেশ করে অমরা ও ভ্রূণ নামে দুভাগে ভাগ হয়েছে।",
    "শিশুটি এখন কমলার বিচির সমান, দেখতে ব্যাঙ্গাচির মত। হৃদপিণ্ডের গঠন শুরু হয়েছে।",
    "তার হৃদপিণ্ড এখন মিনিটে প্রায় দেড়শো বার লাফাচ্ছে। ফুসফুস, মস্তিষ্ক এবং হাড়ও তৈরি হচ্ছে।",
    "শিশুর হাত-পা বের হয়েছে, মুখ ও জিহ্বা তৈরি হয়েছে, এবং কিডনি কাজ শুরু করেছে।",
    "শিশুটি এখন শিমের বিচির সমান। তার আঙ্গুল, পায়ের পাতা, শ্বাসনালী ও জননাঙ্গ তৈরি হয়েছে।",
    "শিশুটি এখন এক ইঞ্চি লম্বা একটি আঙুরের সমান। তার দাঁতের মূল গজানো শুরু হয়েছে।",
    "সুপারির সমান শিশুটির গুরুত্বপূর্ণ অঙ্গগুলো সঠিক জায়গায় চলে গেছে। তার আঙুলে নখ ও মাথায় চুল গজাচ্ছে।",
    "শিশু নড়াচড়া করা শুরু করেছে! তার নাকের ফুটো তৈরি হয়েছে এবং শরীরের হাড় শক্ত হচ্ছে।",
    "সে এখন লম্বায় তিন ইঞ্চি ও দেখতে লেবুর মত। সাদা রক্তকোষ এবং কিডনি থেকে মুত্র তৈরি হচ্ছে।",
    "সে এখন হাত-পা নাড়াতে পারে, বুড়ো আঙুল মুখে নিতে পারে। তার কন্ঠনালী তৈরি হচ্ছে।",
    "শিশুর শরীরজুড়ে লোমের মত লানুগো তৈরি হয়েছে। সে এখন নানাভাবে মুখ বাঁকাতে পারে।",
    "শিশুটি লম্বায় প্রায় চার ইঞ্চি, ওজনে মুরগীর ডিমের সমান। তার চোখ বন্ধ, কিন্তু সে আলো অনুভব করতে পারে।",
    "শিশুটি এখন আপেলের সমান। সে কানে শুনতে পাচ্ছে, তার সাথে কথা বলুন!",
    "শিশুর হৃদপিন্ড এখন পুরোপুরি তার মস্তিষ্কের নিয়ন্ত্রণে। তার আঙুলের ছাপ তৈরি হচ্ছে!",
    "শিশুটি এখন লম্বায় প্রায় ছয় ইঞ্চি ও ওজনে ২০০ গ্রাম। লক্ষ্য করলে আপনি তার নড়াচড়া অনুভব করবেন।",
    "শিশু আকারে প্রায় একটি বড় আমের সমান। তার হাত-পা এখন শরীরের সাথে মানানসই।",
    "শিশু এখন প্রায় সাড়ে ছয় ইঞ্চি লম্বা। সে ছেলে নাকি মেয়ে জানতে চাইলে আলট্রাসাউণ্ড করুন।",
    "শিশুর ভ্রূ এবং চোখের পাতা এখন সম্পূর্ণ তৈরি। তার মস্তিষ্কের কোষগুলো সচল। আপনি শিশুর লাথি অনুভব করতে পারেন!",
    "শিশুর চোখের গড়ন তৈরি হলেও চোখের মনি তৈরি হওয়া এখনও বাকি। তার নখ তৈরি হচ্ছে!",
    "শিশুর ফুসফুস শ্বাসগ্রহনের জন্য তৈরি হচ্ছে। শিশুটি ছেলে হলে তার অন্ডকোষ দৃশ্যমান, মেয়ে হলে জরায়ু ও ডিম্বাশয় এখন তৈরি।",
    "আপনার শিশুটি এখন প্রায় ১৩ ইঞ্চি লম্বা ও ৬০০ গ্রাম ওজনের। তার মাথায় সত্যিকারের চুল গজানো শুরু করেছে!",
    "শিশু এখন দেখতে ফুলকপির মত। সে নিজের পা ছুঁতে ও হাত মুঠো করতে পারে। আপনার সঙ্গী পেটে কান লাগালে তার হৃদস্পন্দন শুনতে পারবেন।",
    "শিশুর ফুসফুস এবং শ্রবণক্ষমতা দিনে দিনে পরিনত হচ্ছে। আপনি এবং আপনার সঙ্গী তার সাথে গল্প করুন।",
    "শিশু লম্বায় প্রায় ১৪ ইঞ্চি, ওজনে ৯০০ গ্রাম। সে আপনার আওয়াজ চিনতে পারছে, এবং তার চোখ খুলতে পারছে।",
    "অভিনন্দন! আপনার বাচ্চা এখন এক কেজি ওজনের। সে আলো দেখতে পারে, এমনকি চোখ থেকে পানি পর্যন্ত ফেলতে পারে।",
    "শিশুর মস্তিষ্ক শ্বাসগ্রহণ এবং শরীরের তাপমাত্রা নিয়ন্ত্রণ করতে পারছে। সে এখন থেকেই স্বপ্ন দেখতে পারে!",
    "১৬ ইঞ্চির শিশুটি এখন প্রায় সোয়া কেজি ওজনের। তার নড়াচড়া করার হার আগের চেয়ে বেড়ে যেতে পারে!",
    "সে তার মাথা ডানে-বামে ঘোরাতে পারে এবং তার পঞ্চ-ইন্দ্রিয় সক্রিয় হয়েছে।",
    "শিশুটি এখন প্রায় ১৭ ইঞ্চি লম্বা ও ওজনে এক কেজি ৮০০ গ্রাম। তার গিলে এবং চুষে খাবার ক্ষমতা তৈরি হয়েছে!",
    "শিশুর ওজন এখন প্রায় দুই কেজি। তার আশেপাশে নড়াচড়া করার জায়গা কমে গিয়েছে। সে এখন দিন ও রাতের পার্থক্য ধরতে পারছে!",
    "শিশুর মস্তিষ্ক খুব দ্রুত বিকশিত হচ্ছে  ও স্নায়ুতন্ত্র পরিনত হচ্ছে। তার ওজন প্রায় দুই কেজি ২০০ গ্রাম ও লম্বায় সে ১৮ ইঞ্চি।",
    "এখন জন্ম হলে শিশুর বাঁচার সম্ভাবনা শতকরা ৯৯ ভাগ। তার মাথা নিচের দিকে চলে এসেছে, এবং কিডনি প্রায় সম্পূর্ণ গঠিত।",
    "অভিনন্দন, আপনার বাচ্চা জন্ম হওয়ার জন্য এখন মোটামুটি তৈরি। ওজনে সে আড়াই কেজিরও বেশী!",
    "শিশুটি এখন প্রায় ২০ ইঞ্চি লম্বা, ওজনে তিন কেজি। সে ছোটখাট জিনিস আঁকড়ে ধরতে পারে। তার মাথাভর্তি চুল গজিয়েছে।",
    "শিশুর স্বরতন্ত্র তৈরি হয়ে গেছে। জন্মের পর চীৎকার করার জন্য সে এখন পুরোপুরি তৈরি!",
    "শিশুর মাথার ওজন এখন তার শরীরের তিন ভাগের এক ভাগ। তার অন্যান্য অঙ্গপ্রত্যঙ্গ প্রায় সম্পূর্ণ তৈরি।",
    "দীর্ঘ পথ পরিক্রমায় আপনাকে অভিনন্দন। শিশু আপনার কোলে আসার জন্য এখন সম্পূর্ণ প্রস্তুত!",
    "শিশুটির ওজন এখন সাড়ে তিন কেজির কাছাকাছি। আগামী সপ্তাহের মধ্যেও সে বেরোতে না চাইলে ডাক্তার তাকে জোর করে বের করতে চাইবেন!",
    "ডাক্তারের পরামর্শ নিন।"
  ];

  static final List<String> dummyWeeklyChange = [
    '3',
    '4',
    '5',
    '6',
    '7',
    '8',
    '9',
    '10',
    '11',
    '12',
    '13'
  ];


  static const String weekNo = 'সপ্তাহ নংঃ ';

  static const String emergency = 'ইমারজেন্সি';
  static const String responsibility = 'দায়িত্ব';
  static const String food = 'খাবার';
  static const List<String> sympNameList = [];
  //The Android's default system path of this application database.
  /*public static String DB_PATH = "/data/data/com.app.app/databases/";*/
  static const String DB_NAME = "app.db";
  static const int VERSION = 1;

  //Emergency
  static const String emergencyTip =
      'নিচে উল্লেখিত লক্ষণসমূহ দেখা গেলে গর্ভবতী মাকে সাথে সাথে নিকটস্থ হাসপাতালে নিয়ে যান।';
  static const List<String> emergDataTitle = [
    "অতিরিক্ত রক্তক্ষরণঃ",
    "প্রচণ্ড বমি এবং অতিরিক্ত বমি বমি ভাবঃ",
    "শিশুর নড়াচড়া অস্বাভাবিক হারে কম হওয়াঃ",
    "সংকোচন-প্রসারন বা খিঁচুনীর মাত্রা বেড়ে যাওয়াঃ",
    "পানি ভাঙ্গাঃ",
    "প্রিক্ল্যাম্পসিয়াঃ",
    "ভাইরাস জ্বরঃ "
  ];

  static const List<String> emergImageAssetUri = [
    'lib/assets/images/e1.jpg',
    '',
    'lib/assets/images/e2.jpg',
    'lib/assets/images/e4.jpg',
    '',
    '',
    'lib/assets/images/e7.jpg'
  ];

  static const List<String> emergencyDesc = [
    "গর্ভাবস্থার প্রথম তিনমাস কালে যদি অতিরিক্ত রক্তক্ষরণ এবং সেই সাথে তলপেটে প্রচণ্ড ব্যাথা অনুভব হয়, সেই সাথে যদি জ্ঞান হারিয়ে ফেলতে বসে, তবে সাথে সাথে ডাক্তারের শরণাপন্ন হওয়া উচিত। প্রথম তিনমাস কাল অথবা দ্বিতীয় তিনমাস কালের শুরুতে যদি অতিরিক্ত রক্তক্ষরণের সাথে সাথে খিঁচুনী বা সংকোচন-প্রসারণ হয়, তাহলে সেটা গর্ভপাতের  লক্ষণ হতে পারে। শেষ তিনমাস কালে রক্তপাত ও তলপেটে ব্যাথা অনেকটা স্বাভাবিক। তবে যেকোন ধরনের পরিস্থিতিতে ডাক্তারের সাথে আগে যোগাযোগ করুন।",
    "বমি বমি ভাব গর্ভাবস্থায় খুব সাধারণ একটি উপসর্গ। তবে সেটি যদি অতিরিক্ত হয়ে যায়, তবে তা জটিলতা বোঝাতে পারে। বমি বমি ভাব অতিরিক্ত হলে মায়ের খাবার খাওয়ার এবং পানি পান করার পরিমান কমে যাবে, যা শিশুর বৃদ্ধিতে অত্যন্ত নেতিবাচক প্রভাব ফেলতে পারে। তাই আপনার বমি বমি ভাব যদি অতিরিক্ত হয় এবং এতে যদি আপনার খাওয়া দাওয়ার উপর প্রভাব পড়ে, তবে অতিসত্তর ডাক্তারের বা স্বাস্থ্যকর্মীর পরামর্শ অনুযায়ী খাদ্যাভ্যাসে পরিবর্তন আনুন ও ঔষধ সেবন করুন।",
    "শিশুর নড়াচড়ার হার কমে গেলে ফলের রস, দুধ বা তরল জাতীয় কিছু পান করুন, এরপর অনুভব করার চেষ্টা করুন শিশু নড়াচড়া করছে কিনা। গর্ভাবস্থার শেষ তিনমাসে শিশু সাধারণত প্রতি দুই ঘণ্টায় দশ বারের অধিক লাথি দেয়। যদি শিশুর লাথি দেয়ার হার এর চেয়ে কম হয়, তবে অতিসত্তর ডাক্তারের শরণাপন্ন হন।",
    "সাধারণত গর্ভাবস্থার শেষ তিনমাস কালের সময় সংকোচন-প্রসারণের মাত্রা বাড়বে, যদিও এ সংকোচন-প্রসারণের ধরন প্রসবকালীন সংকোচন-প্রসারণের চেয়ে আলাদা। কি ভাবে ? যদি সংকোচন-প্রসারণ অনিয়মিত হারে হয়, যদি এর সময়কাল ১৫-২০ এর মধ্যে হয় এবং হাঁটাচলা করলে এর মাত্রা হ্রাস পায়, তবে এটি স্বাভাবিক সংকোচন-প্রসারণ। যদি তা নিয়মিত হারে আসা শুরু করে, এর ব্যপ্তি যদি ৩০ সেকেন্ডের বেশী হয়, সময়ের সাথে সাথে যদি আরও দ্রুত হারে আসে এবং অনেকক্ষণ ধরে বজায় থাকে, তবে যত তাড়াতাড়ি সম্ভব ডাক্তারের শরণাপন্ন হন।",
    "গর্ভাবস্থায় শেষদিকে তরল নির্গমন দুই রকম হতে পারে। তরল নির্গমনের মাত্রা যদি অল্প হয়, তাতে যদি গন্ধ থাকে এবং হলদেটে ভাব থাকে, তবে সেটা সাধারণত মূত্র। তবে তরল নির্গমনের মাত্রা যদি খুবই বেশি হয় এবং তরল যদি স্বচ্ছ ও গন্ধহীন হয়, তবে সেটি সাধারনত প্রসব ঘনিয়ে আসার লক্ষণ। দ্বিতীয় ক্ষেত্রে অতিসত্তর ডাক্তার অথবা ধাত্রীর সাথে যোগাযোগ করুন। ",
    "শরীরে রক্তচাপ অত্যন্ত বেড়ে গিয়ে মুখ, হাত-পা বা শরীরের অন্যান্য অংশ অস্বাভাবিক হারে ফুলে যাওয়াকে প্রিক্ল্যাম্পসিয়া বলে, যার আবির্ভাব সাধারণত ৩৬-৩৭তম সপ্তাহের পরে ঘটে। কিন্তু এর আগেই এই জটিলতা দেখা দিলে বা দীর্ঘক্ষণ মাথাব্যাথা, চোখে ঘোলা বা ঝাপসা দেখা, পেটে  তীব্র ব্যাথা বা খুব বেশী বমি হলে অতিসত্তর ডাক্তারের শরণাপন্ন হন।",
    "গর্ভকালীন সময়ের শুরুতে এবং গর্ভাবস্থার মধ্যে মা-কে সাধারণত বিভিন্ন রোগের টিকা দেয়া হয়, যাতে করে ভাইরাস জাতীয় অসুখ হওয়ার সম্ভাবনা অনেকাংশে কমে যায়। তারপরেও আপনি যদি ভাইরাস জ্বরে আক্রান্ত হন, তাহলে আপনি ডাক্তারের সাথে যোগাযোগ করুন। কারন, গর্ভাবস্থায় এ ধরনের জ্বর অনেক জটিলতা নিয়ে আসতে পারে। আর গর্ভাবস্থার পুরো সময়ে অসুস্থ মানুষজনের কাছে যাওয়া পরিহার করুন।"
  ];

  //responsibilities
  static const List<String> respTitle = [
    '১। সাপ্তাহিক পরিবর্তন জেনে সচেতনভাবে গর্ভবতী-মায়ের পাশে থাকুন ও প্রয়োজনে সকল সদস্যের মোবাইলে এই  এ্যাপটি রাখুন:',
    '২। গর্ভবতী-মাকে সকল প্রকার সহায়তা দিন:',
    '৩। বাবা হিসেবে সবসময় গর্ভবতী মায়ের সর্বোচ্চ সেবা নিশ্চিত করুন:',
    '৪। গর্ভবতী মায়ের গর্ভাবস্থার মুহূর্তগুলো স্মৃতিময় করে তোলার চেষ্টা করুন:',
    '৫। ডাক্তারের পরামর্শ অনুযায়ী মায়ের বিভিন্ন ধরণের পরীক্ষা করান:',
    '৬। মায়ের যেকোনো ধরণের উপসর্গ দেখা দিলে যথাযথ ব্যবস্থা নিন:',
    '৭। মায়ের প্রতিদিনের পুষ্টি নিশ্চিত করুন:',
    '৮। মায়ের হাত পা মালিশ করে দিন:',
    '৯। মায়ের সাথে শান্ত আচরণ করুন:',
    '১০। গর্ভবতী মা যাতে প্রচুর পরিমাণ পানি/তরল পান করেন তা নিশ্চিত করুন:',
    '১১। গর্ভবতী মাকে অসুস্থ্য মানুষের কাছে যাওয়া থেকে বিরত রাখুন:',
    '১২। মাকে নিয়মিত ডাক্তার দেখান:',
  ];
  static const List<String> respImgAssetUri = [
    '',
    '',
    'lib/assets/images/r3.jpg',
    'lib/assets/images/r4.jpg',
    'lib/assets/images/r5.jpg',
    'lib/assets/images/r6.jpg',
    'lib/assets/images/r7.jpg',
    '',
    '',
    'lib/assets/images/r10.jpg',
    '',
    'lib/assets/images/r12.jpg',
  ];

  static const List<String> respDesc = [
    "প্রতি সপ্তাহে শিশুর বৃদ্ধি ও বিকাশের পাশাপাশি মায়ের শারীরিক এবং মানসিক পরিবর্তন হয়। সেগুলোর প্রতি লক্ষ্য রেখে মায়ের প্রতি খেয়াল রাখা এবং মায়ের জন্য দেয়া ডাক্তার/স্বাস্থ্য কর্মীর দেয়া নির্দেশনাগুলো সঠিকভাবে পালন করা হচ্ছে তা খেয়াল রাখা শুধু মায়েরই নয়, পরিবারের অন্য সবার জন্যও অত্যন্ত গুরুত্বপূর্ণ। একজন সুস্থ মা সুস্থ শিশুর জন্ম দিতে পারে। কাজেই মায়ের পাশাপাশি পরিবারের প্রত্যেক সদস্যেরই মায়ের গর্ভাবস্থার চলতি সপ্তাহের যাবতীয় তথ্য জানা উচিত এবং সে অনুযায়ী সতর্ক থাকা উচিত। তাই প্রয়োজনে পরিবারের সব সদস্যের মোবাইলে এই এ্যাপটি রাখুন।",
    "গর্ভবতী মায়ের প্রাত্যহিক কাজগুলোতে পরিবারের সবাই মিলে যথাসম্ভব সাহায্য করুন। তিনি সাহায্য চাইবার আগেই নিজে থেকে সাহায্য করা শুরু করুন। তাঁর কাজের ভার যেন যথাসম্ভব কম থাকে সেদিকে লক্ষ্য রাখুন। তাঁকে বেশী করে সময় দিন। তাঁর সাথে কথা বলুন ও তাঁর সমস্যাগুলো মনোযোগ দিয়ে শুনুন। কারণ গর্ভাবস্থায় অধিকাংশ মায়েরাই \"বেবি ব্লুজ\" নামক বিষণ্ণতায় ভোগেন, যা মা এবং শিশু দু’জনের জন্যই ক্ষতিকর। মায়ের দুশ্চিন্তা, ভয় ও মানসিক পরিবর্তনগুলো সম্পর্কে তাঁর কাছ থেকে জানুন। তাঁকে অনুপ্রেরণা যোগান। সর্বপ্রকার মানসিক সহায়তা প্রদান করুন।",
    "সন্তানের প্রতি পিতার যেমন অধিকার আছে তেমনি দায়িত্বও কিন্তু কম নয়। সন্তান মায়ের গর্ভে থাকাকালীন অবস্থায় একজন পিতা প্রত্যক্ষভাবে সন্তানের যত্ন নিতে পারেন না। তবে এসময় মায়ের যথার্থ যত্ন নেয়া মানেই সন্তানের যত্ন নেয়া। কেননা মায়ের মন-মানসিকতা এবং শারীরিক সুস্থতা গর্ভের সন্তানের উপর সরাসরি প্রভাব ফেলে। তাই মায়ের গর্ভধারণের শুরু থেকে প্রসবের পর মা সন্তানের দায়িত্ব বুঝে নেবার আগ পর্যন্ত পিতাকে মায়ের সকল প্রকার চাহিদার প্রতি লক্ষ্য রাখুন। মায়ের সঠিক মাত্রার আরাম এবং তাঁর পরিচর্যা নিশ্চিত করুন। তাঁকে ঢোলাঢোলা কাপড়চোপড় পরতে উৎসাহিত করুন। মাকে যথাসম্ভব সময় দিন এবং যেকোন পরিস্থিতিতে মায়ের পাশে থাকুন।",
    "গর্ভকালীন সময়টাকে স্মৃতিময় করে রাখতে বিভিন্নভাবে মাকে সহযোগিতা করতে পারেন। মাকে মজাদার এবং স্বাস্থ্যকর খাবার রান্না করে খাওয়ান। সুন্দর ও সুখকর স্মৃতি নিয়ে গল্প করুন। মায়ের গর্ভাবস্থার বিভিন্ন বড় বড় পরিবর্তনগুলো ছবিতে ধরে রাখুন। সন্তানের পরিবর্তনসমূহ নিয়ে মায়ের সাথে কথা বলুন। যে সপ্তাহ থেকে সন্তান পেটের মধ্যে কথা শুনতে শুরু করে, তার সাথে আদর করে কথা বলুন। এতে করে গর্ভবতী মা একটি সুন্দর মুহুর্তের কারণে উৎফুল্ল হয়ে উঠবে।",
    "বিভিন্ন সপ্তাহে ডাক্তারের পরামর্শক্রমে মায়ের বিভিন্ন ধরনের পরীক্ষা, যেমন- রক্তস্বল্পতা, আর-এইচ, আলট্রাসাউন্ড, আয়রন, জি-বি-এস ইত্যাদি পরীক্ষা করা অত্যন্ত জরুরি। সময়মত এই পরীক্ষাগুলো করা হচ্ছে কি না সেদিকে খেয়াল রাখুন। মাকে পরীক্ষার কথা মনে করিয়ে দিন অথবা নিজেই তাকে নিয়মমতো পরীক্ষা করাতে নিয়ে যান।",
    "গর্ভাবস্থার বিভিন্ন সময়ে মায়ের বিভিন্ন ধরনের উপসর্গ দেখা দেয়, যেমন ক্লান্তি বা অবসাদবোধ, ক্ষুধামন্দা, বমি বমি ভাব, হাতে-পায়ে খিল ধরা, ঘনঘন মানসিক অবস্থার পরিবর্তন , পিঠে বা কোমরে ব্যাথা, অনিদ্রা, মাথাব্যাথা, স্মৃতিশক্তি হ্রাস পাওয়া, চোখে ঝাপসা দেখা, শরীরে ফাটা দাগ দেখা দেয়া, পা কামড়ানো ইত্যাদি। মা কোন সময় কেমন অনুভব করছেন তা জানুন, এবং সে অনুযায়ী উপযুক্ত ব্যাবস্থা নিন।",
    "মায়ের পর্যাপ্ত বিশ্রাম নিশ্চিত করুন। ক্ষুধামন্দা বা বমি বমি ভাব হলে মাকে তার পছন্দনীয় খাবার খেতে দিন। প্রতিবেলায় মা পুষ্টিকর এবং দরকারি খাবার খাচ্ছেন কি না তার দিকে খেয়াল রাখুন। গর্ভাবস্থায় মা একসাথে পর্যাপ্ত খাবার খেতে পারেন না। বদহজম, বুক জ্বালা-পোড়াসহ নানা সমস্যা দেখা দিতে পারে। এমতাবস্থায়, সাধারণ নিয়মে তিনবেলা খাবারের পরিবর্তে কম কম করে বেশিবার খেতে দিন। আবার অনেক সময় মায়ের প্রচন্ড ক্ষিধে পেতে পারে। মায়ের জন্য হাতের কাছে খাবার রাখুন। মনে রাখবেন, কম কম করে বেশিবার খাদ্যগ্রহণ করলে মায়ের গর্ভপাতের আশঙ্কা অনেকটাই কমে যায়।",
    "গর্ভবতী মায়ের শারীরিক পরিবর্তনের কারণে অনেক সময় হাতে-পায়ে খিল ধরতে বা কামড়াতে পারে।  এসময় তাঁর হাত পা মালিশ করে দিলে তিনি আরাম পাবেন।  এক জায়গায় অনেকক্ষণ দাঁড়িয়ে বা বসে থাকলে তাঁর পা বা পিঠে ব্যথা করতে পারে। তাই তিনি একটু পরপর তার অবস্থান পরিবর্তন করছেন কি না সেদিকে খেয়াল রাখুন।",
    "গর্ভবতী মায়ের শারীরিক ও মানসিক পরিবর্তনের কারণে অনেক সময় উত্তেজিত হয়ে উঠতে, বিষণ্ণতা বোধ করতে, উদ্বিগ্ন হতে বা আবেগাপ্লুত হয়ে উঠতে পারেন।  এটি স্বাভাবিক। মায়ের এ প্রতিক্রিয়াগুলো তাঁর গর্ভকালীন অবস্থার কারণেই হয়। এ অবস্থায় মায়ের সাথে উল্টো প্রতিক্রিয়া দেখাবেন না। তাঁর সাথে শান্ত আচরন করুন। তাঁকে স্বাভাবিক হতে সাহায্য করুন। এছাড়াও অনেক সময় গর্ভবতী মায়ের স্মৃতিশক্তি দুর্বল হয়ে যায়। তিনি চোখে ঝাপসা দেখেন। তাই এসময় তিনি কোনকিছু ভুলে গেলে তাঁর সাথে রাগারাগি করবেন না। বরং তাঁর চলাফেরার দিকে সতর্কভাবে লক্ষ্য রাখুন যেন তিনি পড়ে না যান।",
    "সন্তান এবং মায়ের পরিপূর্ণ বিকাশের জন্য মায়ের শরীরে প্রচুর পরিমাণ পানীয় দরকার। তাই মা নিয়মিত পানি পান করছেন কি না তার দিকে লক্ষ্য রাখুন। এছাড়াও মাকে বিভিন্ন রঙের ফলের জুস, ডাবের পানি, দুধ, স্যুপ খেতে দিন। এতে মায়ের প্রস্রাবের জ্বালাপোড়া থাকলে তা হ্রাস পাবে।",
    "গর্ভাবস্থায় একজন মা অত্যন্ত নাজুক অবস্থায় থাকেন। এসময় তিনি খুব সহজেই রোগজীবাণু আক্রান্ত হতে পারেন। মা সঠিক সময়ে  টিকা নিচ্ছেন কি না সেদিকে লক্ষ্য রাখুন। তাঁকে অসুস্থ মানুষদের কাছে যেতে দেবেন না, বা অসুস্থ কাউকে তাঁর কাছে আসতে দেবেন না। মায়ের চারপাশের পরিবেশ পরিষ্কার পরিচ্ছন্ন আছে কি না তা নিশ্চিত করুন। স্যাঁতস্যাঁতে এবং গরম পরিবেশে মা যেনো বেশিক্ষণ না থাকেন সেদিকে নজর রাখুন। এতে গর্ভবতী মায়ের ছত্রাক সংক্রমনের আশঙ্কা কমে যাবে।",
    "পয়ত্রিশতম সপ্তাহ থেকে প্রসবের আগ পর্যন্ত মাকে নিয়মিত ডাক্তার দেখাতে হবে। কিন্তু এসময় মায়ের চলাচল করা অত্যন্ত অসুবিধাজনক। তাই ডাক্তারের কাছে যাওয়ার সময় মাকে অবশ্যই সঙ্গ দিন। এবং সম্ভব হলে বাসায় ডাক্তার বা স্বাস্থ্যকর্মী নিয়ে আসুন। প্রসবকালীন সময়ের প্রয়োজনীয় জিনিসপত্র গুলো, যেমন মায়ের জন্য পরিষ্কার আরামদায়ক পোশাক, তোয়ালে, শিশুর ডায়াপার, নবজাতকের কাপড়, দরকারী ঔষধপত্র একটি ব্যাগে গুছিয়ে রাখুন। সার্বক্ষনিক ডাক্তার, এ্যাম্বুলেন্স ও হাসপাতালের নম্বর হাতের কাছে রাখুন।\nআপনাদের পরিবারে একটি সুস্থ ও সুন্দর শিশুর আগমন ঘটুক!"
  ];

  //foods
  static const List<String> foodTitles = [
    '',
    'প্রোটিন বা আমিষ:',
    'খাদ্য তালিকা:',
    'ক্যালসিয়াম:',
    'খাদ্য তালিকা:',
    'আয়রন:',
    'আয়রনযুক্ত খাদ্য তালিকা:',
    'ভিটামিন সি যুক্ত খাদ্য তালিকা:',
    'ফোলেট:',
    'খাদ্য তালিকা:',
    'ভিটামিন এ:',
    'খাদ্য তালিকা:',
    'ভিটামিন বি-১২:',
    'খাদ্য তালিকা:',
    'ভিটামিন ডি:',
    'খাদ্য তালিকা:',
    'আয়োডিন:',
    'খাদ্য তালিকা:',
    'ওমেগা-৩ ফ্যাট:',
    'খাদ্য তালিকা:',
    'এছাড়া গর্ভকালীন সময়ে কিছু কিছু খাদ্য হতে বিরত থাকা উচিত, যেমন:',
  ];
  static const List<String> foodImages = [
    '',
    '',
    'lib/assets/images/img_protine.png',
    '',
    'lib/assets/images/imag_calcium.png',
    '',
    'lib/assets/images/img_iron.png',
    'lib/assets/images/imd_vitac.png',
    '',
    'lib/assets/images/img_flotalr.png',
    '',
    'lib/assets/images/img_vaiita6.png',
    '',
    'lib/assets/images/img_vitab12.png',
    '',
    'lib/assets/images/img_vitad.png',
    '',
    'lib/assets/images/img_iodine.png',
    '',
    'lib/assets/images/img_omega3.png',
    '',
  ];
  static const List<String> foodDesc = [
    '',
    "প্রোটিন আপনার শিশু-ভ্রূণের গঠন ও বৃদ্ধি নিশ্চিত করে।",
    "১। দুধ ও দুগ্ধজাতীয় খাদ্য, যেমন: দই, মাখন, পনির\n২। সিদ্ধ অথবা রান্না করা ডিম\n৩। মাছ\n৪। মাংস\n৫। ডাল\n৬। শিম\n৭। মটর\n",
    "ক্যালসিয়াম আপনার শিশুর হাড় গঠন করে।\n",
    "১। দুধ ও দুগ্ধজাতীয় খাদ্য\n২। সয়াবিন বীজ\n৩। নটে শাক\n৪। তিল\n৫। সুর্যমুখীর বীজ\n৬। ফুলকপি\n৭। কচুশাক\n",
    "আয়রন শিশুর রক্ত গঠনে সহায়তা করে। শিশু প্রসবের সময় যে রক্তক্ষরণ হয় তা পূরণের জন্য আয়রন খুব জরুরি। এমনকি গর্ভাবস্থায় আয়রন কম পেলে পরবর্তীতে শিশুর মধ্যে রক্তস্বল্পতা দেখা দিতে পারে।\nআপনার শরীর যাতে আয়রন ভালোমত গ্রহণ করে সেজন্য আয়রন যুক্ত খাবারের পাশাপাশি ভিটামিন সি যুক্ত খাবার গ্রহণ করুন, এবং চা ও কফি জাতীয় পানীয় যতটা সম্ভব কম পান করুন।\n",
    "১। যকৃত বা কলিজা\n২। নটে শাক\n৩। ফুলকপি\n৪। কচু শাক\n৫। তিল\n৬। শাপলার ডাঁটা\n৭। খেজুর\n৮। ডাল\n",
    "১। আমলকি এবং টকজাতীয় ফল\n২। পেয়ারা\n৩। লেবু\n",
    "ফোলেট আপনার শিশুর বিকাশের জন্য খুবই জরুরি, বিশেষ করে গর্ভকালীন সময়ের শুরু হতে পরবর্তী ১২ সপ্তাহ পর্যন্ত শিশুর বৃদ্ধিতে ফোলেট বা ফোলিক এসিডের কোন বিকল্প নেই।\n",
    "১। নটে শাক\n২। পালং শাক\n৩। বাধাকপি\n৪। কচুর লতি\n৫। শিমের বীজ\n৬। সিদ্ধ অথবা রান্না করা ডিম\n৭। ডাল\n",
    "ভিটামিন এ আপনার শিশুর দৃষ্টিক্ষমতা এবং রোগ প্রতিরোধ ক্ষমতা বৃদ্ধিতে সাহায্য করে।\n",
    "১। আম\n২। গাজর\n৩। মিষ্টি আলু\n৪। টমেটো\n৫। সবুজ শাক যেমন: পুঁইশাক, পালংশাক\n৬। সিদ্ধ অথবা রান্না করা ডিম\n৭। মাছ, বিশেষ করে মলা-ঢেলা, কাঁচকি জাতীয় ছোট মাছ\n৮। দুধ\n",
    "ভিটামিন বি-১২ এর অভাব শিশুর মস্তিষ্ক এবং মেরুদণ্ডের বিকাশে বাধা দেয়। এছাড়াও এটি রক্তস্বল্পতা দুর করতে সাহায্য করে।\n",
    "১। দুধ ও দুগ্ধজাতীয় খাবার\n২। সিদ্ধ অথবা রান্না করা ডিম\n",
    "ভিটামিন-ডি ক্যালসিয়ামের পাশাপাশি আপনার শিশু-ভ্রূণের হাড় গঠন ও বৃদ্ধিতে সহায়তা করে। ভিটামিন-ডি এর সবচেয়ে উত্তম উৎস হল সূর্যের আলো। এছাড়া নিম্নলিখিত উৎসগুলো থেকেও আপনি  ভিটামিন-ডি পেতে পারেন। \n",
    "১। দুধ ও দুগ্ধজাতীয় খাদ্য\n২। মাছ\n৩। সিদ্ধ অথবা রান্না করা ডিম\n",
    "আয়োডিন আপনার শিশুর শারীরিক ও মানসিক বৃদ্ধিতে সহায়তা করে।\n",
    "১। আয়োডিনযুক্ত লবণ\n২। আয়োডিনযুক্ত মাছ, যেমন: সামুদ্রিক মাছ।\n৩। দুধ ও দুগ্ধজাতীয় খাবার\n৩। সিদ্ধ অথবা রান্না করা ডিম\n",
    "ওমেগা-৩ ফ্যাট শিশু-ভ্রূনের মস্তিষ্ক ও দৃষ্টিশক্তি বৃদ্ধিতে সাহায্য করে। ওমেগা-৩ ফ্যাট সাধারণত বড় মাছে বেশি পাওয়া যায়। তবে বড় মাছে অতিরিক্ত সীসা থাকার সম্ভাবনা থাকে, যা শিশুর জন্য ক্ষতিকর হতে পারে। তাই ডাক্তারের পরামর্শক্রমে প্রয়োজনীয় পরিমাণ ওমেগা-৩ গ্রহণ করুন।\n",
    "১। বড়মাছ যেমন রুই বা কার্পজাতীয় মাছ\n২। আখরোট\n",
    "১। অতিরিক্ত তেল বা মসলাযুক্ত খাবার\n২। আধা-সিদ্ধ ডিম\n৩। কাঁচা শাকসবজি\n \nমাছ ও মাংস অবশ্যই ভালো করে রান্না করে খান। বাইরের খাবার যতটা সম্ভব এড়িয়ে চলার চেষ্টা করুন। সকল ধরণের খাদ্য গ্রহণের আগে সর্বদা ডাক্তার বা স্বাস্থ্যকর্মীর পরামর্শ গ্রহণ করুন।\n",
  ];
  static const List<String> food_description = [
    "খাদ্য তালিকা:\n১। দুধ ও দুগ্ধজাতীয় খাদ্য, যেমন: দই, মাখন, পনির\n২। সিদ্ধ অথবা রান্না করা ডিম\n৩। মাছ\n৪। মাংস\n৫। ডাল\n৬। শিম\n৭। মটর<br />",
    "খাদ্য তালিকা:\n১। দুধ ও দুগ্ধজাতীয় খাদ্য\n২। সয়াবিন বীজ\n৩। নটে শাক\n৪। তিল\n৫। সুর্যমুখীর বীজ\n৬। ফুলকপি\n৭। কচুশাক\n",
    "আয়রনযুক্ত খাদ্য তালিকা:\n১। যকৃত বা কলিজা\n২। নটে শাক\n৩। ফুলকপি\n৪। কচু শাক\n৫। তিল\n৬। শাপলার ডাঁটা\n৭। খেজুর\n৮। ডাল\nভিটামিন সি যুক্ত খাদ্য তালিকা:\n১। আমলকি এবং টকজাতীয় ফল\n২। পেয়ারা\n৩। লেবু\n",
    "খাদ্য তালিকা:\n১। নটে শাক\n২। পালং শাক\n৩। বাধাকপি\n৪। কচুর লতি\n৫। শিমের বীজ\n৬। সিদ্ধ অথবা রান্না করা ডিম\n৭। ডাল\n",
    "খাদ্য তালিকা:\n১। আম\n২। গাজর\n৩। মিষ্টি আলু\n৪। টমেটো\n৫। সবুজ শাক যেমন: পুঁইশাক, পালংশাক\n৬। সিদ্ধ অথবা রান্না করা ডিম\n৭। মাছ, বিশেষ করে মলা-ঢেলা, কাঁচকি জাতীয় ছোট মাছ\n৮। দুধ\n",
    "খাদ্য তালিকা:\n১। দুধ ও দুগ্ধজাতীয় খাবার\n২। সিদ্ধ অথবা রান্না করা ডিম\n",
    "খাদ্য তালিকা:\n১। দুধ ও দুগ্ধজাতীয় খাদ্য\n২। মাছ\n৩। সিদ্ধ অথবা রান্না করা ডিম\n",
    "খাদ্য তালিকা:\n১। আয়োডিনযুক্ত লবণ\n২। আয়োডিনযুক্ত মাছ, যেমন: সামুদ্রিক মাছ।\n৩। দুধ ও দুগ্ধজাতীয় খাবার\n৩। সিদ্ধ অথবা রান্না করা ডিম\n",
    "খাদ্য তালিকা:\n১। বড়মাছ যেমন রুই বা কার্পজাতীয় মাছ\n২। আখরোট\n"
  ];

  //Jiggasha
  static const List<String> questions = [
    "১ঃ কোন কোন বিষয়গুলো খেয়াল করলে বাচ্চার অটিজমের সম্ভাবনা কমিয়ে আনা যায়?",
    "২ঃ গর্ভকালীন সময়ে স্বামী-স্ত্রীর মিলন নিরাপদ কিনা? ",
    "৩ঃ গর্ভকালীন সময়ে স্বামী-স্ত্রীর মিলনে বাচ্চার কোন ক্ষতি হয় কিনা?",
    "৪ঃ গর্ভকালীন সময়ে স্বামী-স্ত্রীর মিলনে কি গর্ভপাত ঘটতে পারে?",
    "৫ঃ \"গর্ভকালীন সময়ে আমি মিলনের জন্য টান অনুভব করি না\" - এটা কি স্বাভাবিক?",
    "৬: গর্ভকালীন সময়ে কী কী খাবার পরিত্যাগ করব?",
    "৭: গর্ভকালীন সময়ে রক্তপাত হওয়া কি স্বাভাবিক?",
    "৮: ক্লান্তিবোধ কখন থেকে কমে যাবে?",
    "৯: কি কি লক্ষণ থেকে বোঝা যাবে যে আমি গর্ভবতী?",
    "১০: গর্ভাবস্থায় কী কী খাবার খাব?",
    "১১: গর্ভাবস্থায় ব্যায়াম করা কি সঠিক?",
    "১২: গর্ভপাতের প্রধান লক্ষণ কী কী?",
    "১৩: গর্ভাবস্থায় বুকে জ্বালাপোড়া হলে করণীয় কী?",
    "১৪: গর্ভাবস্থায় কোষ্ঠ্যকাঠিন্য কমানোর উপায় কী?",
    "১৫: গর্ভাবস্থায় ওজন কতটুকু বাড়া উচিৎ?",
    "১৬: গর্ভাবস্থায় চুলে বা নখে মেহেদী লাগানো কি উচিৎ?",
    "১৭: শিশু ছেলে নাকি মেয়ে তা কবে নাগাদ জানা যাবে?",
    "১৮: গর্ভাবস্থায় গরম পানিতে কি গোসল করা যাবে?",
    "১৯: গর্ভাবস্থায় কোন কোন কাজ করা থেকে বিরত থাকব?",
    "২০: গর্ভাবস্থায় ভ্রমণ করা কি উচিৎ?",
    "২১: গর্ভাবস্থায় আমি কি চিত হয়ে শুতে পারব?",
    "২২: গর্ভাবস্থায় সর্দি হলে কী করব?",
    "২৩: গর্ভাবস্থায় ঘন ঘন প্রস্রাবের বেগের জন্য করণীয় কী?",
    "২৪: গর্ভাবস্থায় পায়ের ব্যথায় করণীয় কী?",
    "২৫: গর্ভাবস্থার শেষ তিনমাস কালে ভালো ঘুম হওয়ার জন্য করণীয় কী?",
    "২৬: গর্ভকালীন ডায়াবেটিস ধরা পড়লে করণীয় কী?",
    "২৭: প্রসবের লক্ষণ কী কী?",
    "২৮: প্রসবের জন্য কখন হাসপাতালে যাব?",
    "২৯: প্রসবের জন্য হাতের কাছে কি কি রাখবো?"
  ];

  //Uttho
  static const List<String> answers = [
    "এখনো নিশ্চিত কোন কারণ জানা না গেলেও বিশেষজ্ঞদের মতে অটিজমের অনেকগুলো সম্ভাব্য কারণ আছে। যদিও কোন কোন কারণ নিয়ে তাঁদের মধ্যে মতানৈক্যও আছে, কিন্তু অটিজম শুরু হয় গর্ভকালীন সময়ে- এ বিষয়ে বিজ্ঞানে যথেষ্ট মতৈক্য রয়েছে। নিচে বেশ কয়েকটি মনুষ্য-দায়ী কারণ উল্লেখ করা হলোঃ \nভিটামিন-ডি স্বল্পতা, গর্ভকালীন সময়ে বিষণ্ণতা, গর্ভধারণের পূর্বে স্থূলতা এবং ডায়াবেটিস নিয়ন্ত্রণে না থাকা, থাইরোয়েড স্বল্পতা, গর্ভকালীন সময়ে ভাইরাস-ব্যাক্টেরিয়ার কারণে অসুস্থতা, অত্যধিক ওজন বৃদ্ধি (গর্ভধারিণীর ওজন ৫ থেক ১১কেজি পর্যন্ত বৃদ্ধি স্বাভাবিক), প্রাকৃতিক খাবার ব্যতিরেকে ওষুধ-পুষ্টির উপর নির্ভর করা, ওমেগা-৩ যুক্ত খাবার পর্যাপ্ত না খাওয়া, অনিরাপদ (ডাক্তারের পরামর্শ ব্যতিরেকে) ওষুধ সেবন, গর্ভকালীন সময়ে দূষিত পরিবেশে থাকা/যাওয়া, প্রথম তিনমাসে অতিরিক্ত আল্ট্রাসাউন্ড করালে শিশুর নিউরনের বৃদ্ধি বাধাগ্রস্ত হতে পারে।",
    "যদি উভয়ের সম্মতি থাকে তাহলে গর্ভকালীন সময়ে স্বামী-স্ত্রীর মিলন স্বাভাবিক অবস্থায় এবং স্বাভাবিকভাবে (পেটে চাপ না পড়ে এমনভাবে) নিরাপদ। কিন্তু গর্ভধারিণীর কোন সমস্যা থাকলে এ বিষয়ে অবশ্যই ডাক্তারের সাথে পরামর্শ করে নেওয়া জরুরী।  ",
    "যদি উভয়ের সম্মতি থাকে তাহলে স্বাভাবিক অবস্থায় এবং স্বাভাবিকভাবে (পেটে চাপ না পড়ে এমনভাবে) স্বামী-স্ত্রীর মিলন গর্ভের শিশুর জন্য ক্ষতিকর নয়। কিন্তু  গর্ভধারিণীর কোন সমস্যা থাকলে এ বিষয়ে অবশ্যই ডাক্তারের সাথে পরামর্শ করে নেওয়া জরুরী।",
    "যদি উভয়ের সম্মতি থাকে এবং গর্ভধারিণীর গর্ভাবস্থা স্বাভাবিক থাকে তাহলে স্বাভাবিকভাবে (পেটে চাপ না পড়ে এমনভাবে) স্বামী-স্ত্রীর মিলনে গর্ভপাত ঘটার সম্ভাবনা নেই। তবে  গর্ভধারিণীর কোন সমস্যা থাকলে এ বিষয়ে অবশ্যই ডাক্তারের সাথে পরামর্শ করে নেওয়া জরুরী।",
    "অবশ্যই স্বাভাবিক। এসময়ের গর্ভধারিণী অনেকগুলো পরিবর্তনের মধ্যে দিয়ে যান। ব্যক্তিবিশেষে তাই মিলনের জন্য টান অনুভব না করা অস্বাভাবিক নয়। এ সময় স্বামীকে অবশ্যই ধৈর্য ধারণ করে একটি সুন্দর ভবিষ্যতের জন্য অপেক্ষা করা, স্ত্রীকে বুঝা, আগত বাচ্চার প্রস্তুতির জন্য নিজেকে ব্যস্ত রাখা অনেক জরুরী।",
    "কাঁচা শাকসবজি, কাঁচা দুধ, আধা সিদ্ধ মাছ-মাংস খাওয়া থেকে বিরত থাকুন। কারণ এগুলোর ভেতরে অনেক ক্ষতিকারক ব্যাকটেরিয়া থেকে যেতে পারে।",
    "এটি রক্তপাতের মাত্রার উপর নির্ভর করবে।  রক্তক্ষরণের মাত্রা যদি বেশি হয় তবে সাথে সাথে ডাক্তারের সাথে যোগাযোগ করুন।",
    "গর্ভাবস্থার শুরুর দিকে ক্লান্তিবোধ করা স্বাভাবিক ব্যাপার। গর্ভকালীন সময়ের মাঝামাঝিতে তা বেশ কমে যাবে, কিন্তু গর্ভাবস্থার শেষদিকে তা পুনরায় ফিরে আসা শুরু করবে।",
    "একজন গর্ভবতীর মধ্যে যে সমস্ত লক্ষণগুলো সবার আগে উল্লেখযোগ্য ভাবে ফুটে উঠে সেগুলা হল বমি বমি ভাব, ক্ষুধামন্দা, শরীরের তাপমাত্রা বৃদ্ধি পাওয়া, ক্লান্তিবোধ, ঘন ঘন প্রস্রাবের বেগ পাওয়া, গন্ধ পাবার ক্ষমতা বেড়ে যাওয়া ইত্যাদি। তবে এই লক্ষণগুলোর মাত্রা নারীভেদে ভিন্ন ভিন্ন হতে পারে।",
    "প্রচুর পরিমাণে পানি, তাজা ফলমূল এবং শাকসবজি, দুগ্ধ জাতীয় খাবার, মাছ, মাংস আহার করুন।",
    "হ্যাঁ, গর্ভাবস্থায় হাঁটাহাঁটি বা হাত-পায়ের হালকা ব্যায়াম করা উচিৎ। এগুলো আপনার মেজাজ ভালো রাখতে, শরীরে শক্তি যোগাতে, ও ভালো ঘুম হতে সাহায্য করে। তবে যেসব ব্যায়াম করলে আপনার পেটের ওপর সরাসরি আঘাত বা চাপ আসার সম্ভাবনা রয়েছে সেসব ব্যায়াম না করাই উত্তম।",
    "গর্ভপাতের তিনটি প্রধান লক্ষণ হল অতিরিক্ত রক্তপাত, তলপেটে অধিক পরিমানে সংকোচন-প্রসারণ ও অস্বাভাবিক পেটে ব্যথা। এই তিনটি লক্ষণের যেকোন একটি দেখা দিলে সাথে সাথে ডাক্তারের সাথে যোগাযোগ করুন।",
    "অল্প অল্প করে বেশিবার খাবার খান। মশলাযুক্ত খাবার পরিহার করুন। খাবার সময় অল্প অল্প করে পানি পান করুন। ঘুমানোর আধাঘণ্টা হতে একঘন্টা আগে খাদ্য গ্রহণ থেকে বিরত থাকুন। জ্বালাপোড়া কমানোর জন্য ঔষধ সেবনের আগে ডাক্তারের পরামর্শ গ্রহণ করুন। ",
    "প্রচুর পরিমাণে পানি ও ফলের রস পান করুন। উচ্চ আঁশ জাতীয় খাবার, যেমন পুঁইশাক, পালংশাক ইত্যাদি শাকসবজি খান।",
    "গর্ভাবস্থায় নারীভেদে ওজন বৃদ্ধির হার ভিন্ন ভিন্ন হতে পারে। গর্ভধারনের পূর্বে আপনার ওজন উচ্চতা অনুযায়ী স্বাভাবিক থাকলে গর্ভাবস্থার শেষে আপনার ওজন ১১ থেকে ১৫ কেজি পর্যন্ত বাড়া উচিত।",
    "আপনি গর্ভাবস্থায় চুলে বা নখে গাছের মেহেদী লাগাতে পারবেন, তবে কৃত্রিম মেহেদি, রঙ বা নেল পালিশ লাগানো থেকে বিরত থাকা ভালো।",
    "আপনি ১৬ থেকে ১৯ সপ্তাহের মধ্যে আল্ট্রাসাউন্ড পরীক্ষার মাধ্যমে শিশু ছেলে নাকি মেয়ে তা জানতে পারবেন।",
    "কুসুম গরম পানিতে গোসল করা যাবে। তবে অতিরিক্ত গরম পানিতে গোসল করা থেকে বিরত থাকুন, কারণ এটি শিশুর জন্য ক্ষতিকর হতে পারে।",
    "এমন সব কাজ থেকে নিজেকে বিরত রাখুন যেগুলোতে আপনার পড়ে যাওয়ার সম্ভাবনা বেশি থাকে বা পেটের উপর সরাসরি আঘাত লাগতে পারে। যেমনঃ দৌড়াদৌড়ি করা, সিঁড়ি থেকে দ্রুতগতিতে নামা, খেলাধুলা করা, ভারী কিছু তোলা, নাগরদোলা জাতীয় জিনিসে আরোহণ করা ইত্যাদি।",
    "আপনি ডাক্তারের পরামর্শ নিয়ে গর্ভাবস্থায় ভ্রমণ করতে পারবেন, তবে এসময় অত্যন্ত সতর্ক থাকতে হবে যাতে কোন রকম ঝাঁকুনি না লাগে। তবে গর্ভাবস্থার প্রথম ও শেষ তিনমাস কালে, বিশেষ করে প্রথম তিনমাস কালে ভ্রমণ থেকে যথাসম্ভব বিরত থাকা উচিত। এমনকি এসময় ডাক্তারের কাছে যাওয়ার সময়ও সাবধানে যাওয়া উচিত।",
    "গর্ভাবস্থায় একপাশে কাত হয়ে শোয়া উত্তম। চিত হয়ে শুলে জরায়ুর অতিরিক্ত ওজন জরায়ুর নিচের প্রধান শিরার উপর চাপ দিতে পারে, যাতে শরীরের রক্ত চলাচল বাধাগ্রস্ত হবার উচ্চ সম্ভাবনা থাকে। তাই চিত হয়ে শোয়া থেকে বিরত থাকার চেষ্টা করুন।",
    "গর্ভাবস্থায় বেশিরভাগ মা-ই সর্দিজ্বরে আক্রান্ত হয়ে থাকেন। এসময় আদা-চা পান করতে পারেন, এবং লবণ পানি দিয়ে গড়গড়া করতে পারবেন। তবে সর্দির জন্য যে কোন ধরণের ঔষধ সেবনের আগে ডাক্তারের পরামর্শ গ্রহণ করুন।",
    "গর্ভাবস্থায় আপনার কিডনি স্বাভাবিকের চেয়ে ৫০ ভাগ বেশি রক্ত পরিশোধন করে। তাছাড়া আপনার ক্রমাগত বৃদ্ধি পাওয়া জরায়ু মুত্রথলির উপর চাপ দেয়, যার কারণে আপনার ঘন ঘন প্রস্রাবের বেগ পায়। যদিও গর্ভাবস্থায় বেশি করে পানি পান করা উচিৎ, তবুও আপনি ঘুমানোর আগে অপেক্ষাকৃত কম পানি পান করুন।",
    "গর্ভাবস্থায়, বিশেষ করে গর্ভাবস্থার শেষ তিনমাস কালে পায়ে ব্যথা করা স্বাভাবিক। এটি কমানোর জন্য আপনি বসে থাকার সময় আপনার পা মেঝে থেকে তুলে কিছুক্ষণ সোজা করে রেখে নামিয়ে ফেলুন, এবং একটু পরপর এর পুনরাবৃত্তি করুন। এছাড়া ঘুমানোর সময় দুই পায়ের মাঝে বালিশ দিয়ে কাত হয়ে শুতে পারেন।",
    "এই সময় ভালো ঘুম হওয়াটা একটু কষ্টকর। তবে দুই পায়ের মাঝে বালিশ দিয়ে ঘুমালে কিছুটা স্বস্তি পেতে পারেন। এই সময়কালে চিত হয়ে শোয়া সম্পূর্ণরূপে পরিহার করুন। সম্ভব হলে বামপাশে কাত হয়ে শুবেন, এতে আপনার এবং শিশুর শরীরে রক্ত চলাচলের মাত্রা স্বাভাবিক থাকবে।",
    "ডায়াবেটিস ধরা পড়লে আপনার দৈনিক খাদ্যাভাসে পরিবর্তন আনতে হবে, একই সাথে যথাসম্ভব হাঁটাহাঁটি করতে হবে। যেকোন ঔষধ সেবন করার আগে ডাক্তারের পরামর্শ নিন।",
    "শিশু প্রসবের সাধারণ লক্ষণগুলো হল পানি ভাঙ্গা, যৌনপথে রক্ত নির্গমন, পেটে সংকোচন-প্রসারণের মাত্রা বৃদ্ধি, খিঁচুনি, কোমরে বা তলপেটে ব্যথা।",
    "প্রসবের লক্ষণগুলো দেখতে পেলে আপনি ডাক্তার অথবা ধাত্রীর সাথে যোগাযোগ করে প্রসবের সময় নির্ধারন করুন। হাসপাতাল দুরে হলে বা ডাক্তার বা ধাত্রীর সাথে যোগাযোগ করা সম্ভব না হলে অতিসত্বর হাসপাতালের উদ্দেশ্যে বেরিয়ে পড়ুন।",
    "মায়ের জন্য পরিষ্কার আরামদায়ক পোশাক, তোয়ালে, নবজাতকের কাপড় এবং ডায়াপার, দরকারী ঔষধপত্র, ডাক্তার, এ্যাম্বুলেন্সের এবং হাসপাতালের নম্বর ইত্যাদি হাতের কাছে রাখুন।"
  ];

  //Symptoms list
  static const List<String> Symptoms_EN = [
    "Abdominal Pain",
    "Acne",
    "Appetite",
    "Backaches",
    "Bloating",
    "Body Aches",
    "Breast Sensitivity",
    "Breat Pain",
    "Chills",
    "Constipation",
    "Cramps",
    "Diarrhea",
    "Dizziness",
    "Fatigue",
    "Fever",
    "Frequency of Urination",
    "Headache",
    "Indigestion",
    "Insomnia",
    "Itchy",
    "Leg Inflammation",
    "Migraine",
    "Muscle/Joint Pain",
    "Nausea/Vomiting",
    "Neck Aches",
    "Night Sweat",
    "Pain in the Groin",
    "Shoulder Ache",
    "Sleepiness",
    "Spotting/Bleeding"
  ];

  static const List<String> Symptoms = [
    "পেটে ব্যথা",
    "ক্ষুধামন্দা",
    "পিঠে ব্যথা",
    "গ্যাস্ট্রিক",
    "শরীর ব্যথা",
    "স্তন ব্যথা",
    "কোষ্ঠ্যকাঠিন্য",
    "হাত-পা কামড়ানো",
    "ডায়রিয়া",
    "মাথা ঘুরানো",
    "ক্লান্তি",
    "জ্বর",
    "প্রস্রাবের বেগ",
    "মাথা ব্যথা",
    "বদহজম",
    "অনিদ্রা",
    "চুলকানি",
    "পায়ে জ্বালাপোড়া",
    "গিঁটে ব্যথা",
    "বমি",
    "ঘাড় ব্যথা",
    "কুঁচকিতে ব্যথা",
    "কাঁধে ব্যথা",
    "রক্তপাত",
    "বুকে জ্বালাপোড়া",
    "কোমরে ব্যথা",
    "পা ফোলা",
    "তরল নির্গমন",
    "ব্রণ",
    "রাত্রিকালীন ঘাম"
  ];

  static const String SymptomsIntensity = ",,,,,,,,,,,,,,,,,,,,,,,,,,,,,,";

  static const List<String> TABLE_NAMES = [
    "momnote",
    "momweight",
    "momsymptoms"
  ];

  static const int TOTAL_NUMBER_OF_SYMPTOMS = 30;




  static const double kgToPound = 2.20;
  static const double feetToCm = 30.48;
  static const double incToCm = 2.54;
  static const double feetToInch = 12;
  static final List<double> underWtMn = [
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    2,
    0,
    0,
    5,
    0,
    0,
    0,
    9,
    0,
    0,
    0,
    13,
    0,
    0,
    0,
    17,
    0,
    0,
    0,
    20,
    0,
    22,
    0,
    24,
    25,
    26,
    27,
    28
  ];
  static final List<double> underWtMx = [
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    6,
    0,
    0,
    10,
    0,
    0,
    0,
    15,
    0,
    0,
    0,
    20,
    0,
    0,
    0,
    25,
    0,
    0,
    0,
    30,
    0,
    32,
    0,
    35,
    36,
    37,
    39,
    40
  ];
  static final List<double> normalWtMn = [
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    2,
    0,
    0,
    4,
    0,
    0,
    0,
    8,
    0,
    0,
    0,
    11,
    0,
    0,
    0,
    15,
    0,
    0,
    0,
    18,
    0,
    20,
    0,
    21,
    22,
    23,
    24,
    25
  ];
  static final List<double> normalWtMx = [
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    6,
    0,
    0,
    10,
    0,
    0,
    0,
    14,
    0,
    0,
    0,
    18,
    0,
    0,
    0,
    22,
    0,
    0,
    0,
    27,
    0,
    29,
    0,
    31,
    32,
    32,
    34,
    35
  ];
  static final List<double> overWtMn = [
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    2.0,
    0.0,
    0.0,
    3.0,
    0.0,
    0.0,
    0.0,
    5.0,
    0.0,
    0.0,
    0.0,
    7.0,
    0.0,
    0.0,
    0.0,
    9.0,
    0.0,
    0.0,
    0.0,
    11.0,
    0.0,
    12.0,
    0.0,
    13.0,
    13.0,
    14.0,
    14.0,
    15.0
  ];
  static final List<double> overWtMx = [
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    6.0,
    0.0,
    0.0,
    8.0,
    0.0,
    0.0,
    0.0,
    11.0,
    0.0,
    0.0,
    0.0,
    14.0,
    0.0,
    0.0,
    0.0,
    17.0,
    0.0,
    0.0,
    0.0,
    19.0,
    0.0,
    21.0,
    0.0,
    22.0,
    23.0,
    23.0,
    24.0,
    25.0
  ];
  static final List<double> obeseWtMn = [
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    1,
    0,
    0,
    3,
    0,
    0,
    0,
    4,
    0,
    0,
    0,
    6,
    0,
    0,
    0,
    7,
    0,
    0,
    0,
    8,
    0,
    9,
    0,
    10,
    10,
    10,
    11,
    11
  ];
  static final List<double> obeseWtMx = [
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    4,
    0,
    0,
    6,
    0,
    0,
    0,
    8,
    0,
    0,
    0,
    11,
    0,
    0,
    0,
    13,
    0,
    0,
    0,
    15,
    0,
    16,
    0,
    17,
    18,
    19,
    19,
    20
  ];
}
