// ignore_for_file: constant_identifier_names

class MaaData {
  static const String title_activity_main = 'মা অ্যাপে স্বাগতম';
  static const String next = 'পরবর্তী';
  static const String previous = 'পূর্ববর্তী';
  static const String save = 'সংরক্ষণ';
  static const String welcome = 'স্বাগতম';
  static const String dateChange = 'তারিখ বদলাতে এখানে চাপুন';
  static const String slide_2_title = 'শেষ মাসিক এর প্রথম দিন';
  static const String slide_3_title = 'প্রসবের সম্ভাব্য তারিখ';
  static const String glance = 'এক নজরে';
  static const String week = 'সপ্তাহ';
  static const String day = 'দিন';
  static const String month = 'মাস';
  static const String running = 'এখন চলছেঃ ';
  static const String remaining = 'বাকি রয়েছেঃ ';
  static const String survival_posibilty = ' ৫০% বাঁচার সম্ভাবনা';
  static const String first_timestar = 'প্রথম ত্রৈমাসিক';
  static const String second_timestar = 'দ্বিতীয় ত্রৈমাসিক';
  static const String third_timestar = 'তৃতীয় ত্রৈমাসিক';
  static const String weekly_change = 'সাপ্তাহিক পরিবর্তন';
  static const String text1 = 'বিস্তারিত জানতে এখানে চাপুন';
  static const String text2 = 'তৃতীয় সপ্তাহ হতে এখানে তথ্য দেখতে পাবেন';
  static const List<double> sWidthlist = [37.6, 10.2, 6.5];
  static const List<double> s2Widthlist = [
    2.2,
    2.2,
    2.2,
    2.2,
    2.2,
    2.2,
    2.2,
    2.2,
    2.2,
    28.05
  ];
  static const List<String> sLetterlist = ['A', 'B', 'C'];
  static const List<String> headinglist = [
    'W',
    'T',
    'P',
    'M',
    'S',
  ];
  static const List<String> valuelist1 = [
    'সপ্তাহ',
    'ত্রৈমাসিক',
    'বর্তমান অগ্রগতি',
    'মাস',
    'বাঁচার সম্ভাবনা'
  ];
  static const List<String> valuelist2 = ['অপরিণত', 'স্থিতিকাল', 'অতিপরিণত'];
  static const List<String> bangNum = [
    '০',
    '১',
    '২',
    '৩',
    '৪',
    '৫',
    '৬',
    '৭',
    '৮',
    '৯',
  ];
  static const List<String> bangDateSuffix = ['ম', 'য়', 'র্থ', 'ষ্ঠ', 'শ'];

  static final List<String> shortDescriptionData = [
    "তৃতীয় সপ্তাহ হতে এখানে তথ্য দেখতে পাবেন",
    "তৃতীয় সপ্তাহ হতে এখানে তথ্য দেখতে পাবেন",
    "গর্ভনালীতে প্রায় ১০০ টি কোষের গোলাকার বড়সড় লবনের দানার সমান শিশুপিন্ড তৈরি হয়েছে।",
    "গর্ভনালী থেকে শিশুপিন্ডটি জরায়ুতে প্রবেশ করে অমরা ও ভ্রূণ নামে দুভাগে ভাগ হয়েছে।",
    "শিশুটি এখন কমলার বিচির সমান, দেখতে ব্যাঙ্গাচির মত। হৃদপিণ্ডের গঠন শুরু হয়েছে।",
    "তার হৃদপিণ্ড এখন মিনিটে প্রায় দেড়শো বার লাফাচ্ছে। ফুসফুস, মস্তিষ্ক এবং হাড়ও তৈরি হচ্ছে।",
    "শিশুর হাত-পা বের হয়েছে, মুখ ও জিহ্বা তৈরি হয়েছে, এবং কিডনি কাজ শুরু করেছে।",
    "শিশুটি এখন শিমের বিচির সমান। তার আঙ্গুল, পায়ের পাতা, শ্বাসনালী ও জননাঙ্গ তৈরি হয়েছে।",
    "শিশুটি এখন এক ইঞ্চি লম্বা একটি আঙুরের সমান। তার দাঁতের মূল গজানো শুরু হয়েছে।",
    "সুপারির সমান শিশুটির গুরুত্বপূর্ণ অঙ্গগুলো সঠিক জায়গায় চলে গেছে। তার আঙুলে নখ ও মাথায় চুল গজাচ্ছে।",
    "শিশু নড়াচড়া করা শুরু করেছে! তার নাকের ফুটো তৈরি হয়েছে এবং শরীরের হাড় শক্ত হচ্ছে।",
    "সে এখন লম্বায় তিন ইঞ্চি ও দেখতে লেবুর মত। সাদা রক্তকোষ এবং কিডনি থেকে মুত্র তৈরি হচ্ছে।",
    "সে এখন হাত-পা নাড়াতে পারে, বুড়ো আঙুল মুখে নিতে পারে। তার কন্ঠনালী তৈরি হচ্ছে।",
    "শিশুর শরীরজুড়ে লোমের মত লানুগো তৈরি হয়েছে। সে এখন নানাভাবে মুখ বাঁকাতে পারে।",
    "শিশুটি লম্বায় প্রায় চার ইঞ্চি, ওজনে মুরগীর ডিমের সমান। তার চোখ বন্ধ, কিন্তু সে আলো অনুভব করতে পারে।",
    "শিশুটি এখন আপেলের সমান। সে কানে শুনতে পাচ্ছে, তার সাথে কথা বলুন!",
    "শিশুর হৃদপিন্ড এখন পুরোপুরি তার মস্তিষ্কের নিয়ন্ত্রণে। তার আঙুলের ছাপ তৈরি হচ্ছে!",
    "শিশুটি এখন লম্বায় প্রায় ছয় ইঞ্চি ও ওজনে ২০০ গ্রাম। লক্ষ্য করলে আপনি তার নড়াচড়া অনুভব করবেন।",
    "শিশু আকারে প্রায় একটি বড় আমের সমান। তার হাত-পা এখন শরীরের সাথে মানানসই।",
    "শিশু এখন প্রায় সাড়ে ছয় ইঞ্চি লম্বা। সে ছেলে নাকি মেয়ে জানতে চাইলে আলট্রাসাউণ্ড করুন।",
    "শিশুর ভ্রূ এবং চোখের পাতা এখন সম্পূর্ণ তৈরি। তার মস্তিষ্কের কোষগুলো সচল। আপনি শিশুর লাথি অনুভব করতে পারেন!",
    "শিশুর চোখের গড়ন তৈরি হলেও চোখের মনি তৈরি হওয়া এখনও বাকি। তার নখ তৈরি হচ্ছে!",
    "শিশুর ফুসফুস শ্বাসগ্রহনের জন্য তৈরি হচ্ছে। শিশুটি ছেলে হলে তার অন্ডকোষ দৃশ্যমান, মেয়ে হলে জরায়ু ও ডিম্বাশয় এখন তৈরি।",
    "আপনার শিশুটি এখন প্রায় ১৩ ইঞ্চি লম্বা ও ৬০০ গ্রাম ওজনের। তার মাথায় সত্যিকারের চুল গজানো শুরু করেছে!",
    "শিশু এখন দেখতে ফুলকপির মত। সে নিজের পা ছুঁতে ও হাত মুঠো করতে পারে। আপনার সঙ্গী পেটে কান লাগালে তার হৃদস্পন্দন শুনতে পারবেন।",
    "শিশুর ফুসফুস এবং শ্রবণক্ষমতা দিনে দিনে পরিনত হচ্ছে। আপনি এবং আপনার সঙ্গী তার সাথে গল্প করুন।",
    "শিশু লম্বায় প্রায় ১৪ ইঞ্চি, ওজনে ৯০০ গ্রাম। সে আপনার আওয়াজ চিনতে পারছে, এবং তার চোখ খুলতে পারছে।",
    "অভিনন্দন! আপনার বাচ্চা এখন এক কেজি ওজনের। সে আলো দেখতে পারে, এমনকি চোখ থেকে পানি পর্যন্ত ফেলতে পারে।",
    "শিশুর মস্তিষ্ক শ্বাসগ্রহণ এবং শরীরের তাপমাত্রা নিয়ন্ত্রণ করতে পারছে। সে এখন থেকেই স্বপ্ন দেখতে পারে!",
    "১৬ ইঞ্চির শিশুটি এখন প্রায় সোয়া কেজি ওজনের। তার নড়াচড়া করার হার আগের চেয়ে বেড়ে যেতে পারে!",
    "সে তার মাথা ডানে-বামে ঘোরাতে পারে এবং তার পঞ্চ-ইন্দ্রিয় সক্রিয় হয়েছে।",
    "শিশুটি এখন প্রায় ১৭ ইঞ্চি লম্বা ও ওজনে এক কেজি ৮০০ গ্রাম। তার গিলে এবং চুষে খাবার ক্ষমতা তৈরি হয়েছে!",
    "শিশুর ওজন এখন প্রায় দুই কেজি। তার আশেপাশে নড়াচড়া করার জায়গা কমে গিয়েছে। সে এখন দিন ও রাতের পার্থক্য ধরতে পারছে!",
    "শিশুর মস্তিষ্ক খুব দ্রুত বিকশিত হচ্ছে  ও স্নায়ুতন্ত্র পরিনত হচ্ছে। তার ওজন প্রায় দুই কেজি ২০০ গ্রাম ও লম্বায় সে ১৮ ইঞ্চি।",
    "এখন জন্ম হলে শিশুর বাঁচার সম্ভাবনা শতকরা ৯৯ ভাগ। তার মাথা নিচের দিকে চলে এসেছে, এবং কিডনি প্রায় সম্পূর্ণ গঠিত।",
    "অভিনন্দন, আপনার বাচ্চা জন্ম হওয়ার জন্য এখন মোটামুটি তৈরি। ওজনে সে আড়াই কেজিরও বেশী!",
    "শিশুটি এখন প্রায় ২০ ইঞ্চি লম্বা, ওজনে তিন কেজি। সে ছোটখাট জিনিস আঁকড়ে ধরতে পারে। তার মাথাভর্তি চুল গজিয়েছে।",
    "শিশুর স্বরতন্ত্র তৈরি হয়ে গেছে। জন্মের পর চীৎকার করার জন্য সে এখন পুরোপুরি তৈরি!",
    "শিশুর মাথার ওজন এখন তার শরীরের তিন ভাগের এক ভাগ। তার অন্যান্য অঙ্গপ্রত্যঙ্গ প্রায় সম্পূর্ণ তৈরি।",
    "দীর্ঘ পথ পরিক্রমায় আপনাকে অভিনন্দন। শিশু আপনার কোলে আসার জন্য এখন সম্পূর্ণ প্রস্তুত!",
    "শিশুটির ওজন এখন সাড়ে তিন কেজির কাছাকাছি। আগামী সপ্তাহের মধ্যেও সে বেরোতে না চাইলে ডাক্তার তাকে জোর করে বের করতে চাইবেন!",
    "ডাক্তারের পরামর্শ নিন।"

  ];

  static final List<String> dummyWeeklyChange = [
    '3',
    '4',
    '5',
    '6',
    '7',
    '8',
    '9',
    '10',
    '11',
    '12',
    '13'
  ];

}
